Tekla Open API Reference for Tekla Structures 2025
Plugin.TrySetAttribute Method
Overload List
Name | Description
TrySetAttribute(String, Double)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
TrySetAttribute(String, Int32)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
TrySetAttribute(String, String)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
Top
See Also
Reference
Plugin Class
Tekla.Structures.Drawing Namespace